Revit 2022 API
Document Methods
The Document type exposes the following members.
Methods
Name | Description
AcquireCoordinates
 Acquires coordinates from the specified link instance.
AutoJoinElements
Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
CanEnableCloudWorksharing
 Checks if cloud worksharing can be enabled for the cloud model.
CanEnableWorksharing
 Checks if worksharing can be enabled in the document.
Close()
Closes the document, save the changes if there are.
Close(Boolean)
Closes the document with the option to save.
CombineElements
Combine a set of combinable elements into a geometry combination.
ConvertDetailToModelCurves
Converts a group of DetailCurves to equivalent ModelCurves.
ConvertModelToDetailCurves
Converts a group of ModelCurves to equivalent DetailCurves.
ConvertModelToSymbolicCurves
Converts a group of ModelCurves to equivalent SymbolicCurves.
ConvertSymbolicToModelCurves
Converts a group of SymbolicCurves to equivalent ModelCurves.
Delete(ElementId)
 Deletes an element from the document given the id of that element.
Delete(ICollection<ElementId>)
 Deletes a set of elements from the document.
Dispose
EditFamily
Gets the document of a loaded family to edit.
EnableCloudWorksharing
 Enables cloud worksharing for a cloud model
EnableWorksharing
 Enables worksharing in the document.
Equals
 Determines whether the specified Object equals to this Object.
 (Overrides Object.Equals(Object).)
EraseSchemaAndAllEntities
 Erases Schema and all its Entities from the document.
Export(String, IList<ElementId>, PDFExportOptions)
 Exports a selection of views in PDF format.
Export(String, String, MassGBXMLExportOptions)
 Exports a gbXML file from a mass model document.
Export(String, String, GBXMLExportOptions)
 Export the model in gbXML (green-building) format.
Export(String, String, IFCExportOptions)
 Exports the document to the Industry Standard Classes (IFC) format.
Export(String, String, NavisworksExportOptions)
 Exports a Revit project to the Navisworks .nwc format.
Export(String, String, STLExportOptions)
 Exports the document to the STL format.
Export(String, String, ViewSet, DWFExportOptions)
Exports the current view or a selection of views in DWF format.
Export(String, String, ViewSet, DWFXExportOptions)
Exports the current view or a selection of views in DWFX format.
Export(String, String, ViewSet, FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
Export(String, String, ICollection<ElementId>, DGNExportOptions)
 Exports a selection of views in DGN format.
Export(String, String, ICollection<ElementId>, DWGExportOptions)
 Exports a selection of views in DWG format.
Export(String, String, ICollection<ElementId>, DXFExportOptions)
 Exports a selection of views in DXF format.
Export(String, String, ICollection<ElementId>, SATExportOptions)
 Exports the current view or a selection of views in SAT format.
ExportImage
 Exports a view or set of views into an image file.
GetCloudFolderId
 Gets ForgeDM folder id where the model locates.
GetCloudModelPath
 Gets the cloud model path of the cloud model.
GetCloudModelUrn
 A ForgeDM Urn identifying the model.
GetDefaultElementTypeId
 Gets the default element type id with the given DefaultElementType id.
GetDefaultFamilyTypeId
 Gets the default family type id with the given family category id.
GetDocumentPreviewSettings
 Returns the preview settings for the given document.
GetDocumentVersion
 Gets the DocumentVersion that corresponds to a document.
GetElement(String)
 Gets the Element referenced by a unique id string.
GetElement(ElementId)
 Gets the Element referenced by the input ElementId.
GetElement(Reference)
 Gets the Element referenced by the input reference.
GetHashCode
 Gets the hash code of this document instance.
 (Overrides Object.GetHashCode().)
GetHubId
 Gets ForgeDM hub id where the model locates. It is cached in session.
GetPaintedMaterial
 Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
GetPrintSettingIds
 Retrieves all Print Settings of current project.
GetProjectId
 Gets ForgeDM project id where the model locates.
GetRoomAtPoint(XYZ)
Gets a room containing the point.
GetRoomAtPoint(XYZ, Phase)
Gets a room containing the point.
GetSpaceAtPoint(XYZ)
Gets a space containing the point.
GetSpaceAtPoint(XYZ, Phase)
Gets a space containing the point.
GetSubelement(String)
 Gets the subelement referenced by a unique id string.
GetSubelement(Reference)
 Gets the subelement referenced by the input reference.
GetSubelement(ElementId, Int32)
 Gets the subelement referenced by a parent id and subelement id.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeOfStorage
 Get the storage type of the identified built-in parameter.
GetUnits
 Gets the Units object.
GetWarnings
 Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
GetWorksetId
 Get Id of the Workset which owns the element.
GetWorksetTable
 Get the WorksetTable of this document.
GetWorksharingCentralModelPath
 Gets the central model path of the worksharing model.
HasAllChangesFromCentral
 Returns whether the model in the current session is up to date with central.
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
Import(String, ImportOptions3DM, View)
 Imports a 3DM file into the document.
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
Import(String, SKPImportOptions, View)
 Imports a SKP file into the document.
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
IsBackgroundCalculationInProgress
 Indicates whether there are any background calculations in progress for this document.
IsDefaultElementTypeIdValid
 Checks whether the element type id is valid for the give DefaultElmentType id.
IsDefaultFamilyTypeIdValid
 Checks whether the family type id is valid for the give family category.
IsPainted
 Checks if the element's face is painted with a material.
Link(String, DWFImportOptions)
 Links Markups in a DWF file into the project document.
Link(String, ImportOptions3DM, View)
 Links a 3DM file into the project document.
Link(String, SATImportOptions, View)
 Links an SAT file into the project document.
Link(String, SKPImportOptions, View)
 Links a SKP file into the project document.
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file into the project document.
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file into the project document.
LoadFamily(String)
Loads an entire family and all its types/symbols into the document.
LoadFamily(Document)
 Loads the contents of this family document into another document.
LoadFamily(String, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamily(Document, IFamilyLoadOptions)
 Loads the contents of this family document into another document.
LoadFamily(String, IFamilyLoadOptions, Family)
Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamilySymbol(String, String)
Loads only a specified family type/symbol from a family file into the document.
LoadFamilySymbol(String, String, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
MakeTransientElements
 This method encapsulates the process of creating transient elements in the document.
Paint(ElementId, Face, ElementId)
 Paint the element's face with specified material.
Paint(ElementId, Face, FamilyParameter)
 Paint the element's face with specified material.
PostFailure
 Posts a failure to be displayed to the user at the end of transaction.
Print(ViewSet)
Prints a set of views with default view template and default print settings.
Print(ViewSet, View)
Prints a set of views with a specified view template and default print settings.
Print(ViewSet, Boolean)
Prints a set of views with default view template and default print settings.
Print(ViewSet, View, Boolean)
Prints a set of views with a specified view template and default print settings.
PublishCoordinates
 Publish coordinates to the specified ProjectLocation of the link instance.
Regenerate
Updates the elements in the Revit document to reflect all changes.
ReloadLatest
 Fetches changes from central (due to one or more synchronizations with central) and merges them into the current session.
RemovePaint
 Remove the material painted on the element's face. If the face is currently not painted,it will do nothing.
ResetSharedCoordinates
 Reset shared coordinates for the host model/file.
Save()
 Saves the document.
Save(SaveOptions)
 Saves the document.
SaveAs(String)
 Saves the document to a given file path.
SaveAs(String, SaveAsOptions)
 Saves the document to a given file path.
SaveAs(ModelPath, SaveAsOptions)
 Saves the document to a given path.
SaveAsCloudModel
 Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs.
SaveCloudModel
 Saves cloud model.
SaveToProjectAsImage
 Creates an image view from the currently active view.
SeparateElements
Separate a set of combinable elements out of combinations they currently belong to.
SetDefaultElementTypeId
 Sets the default element type id of the given DefaultElementType id.
SetDefaultFamilyTypeId
 Sets the default family type id for the given family category.
SetUnits
 Sets the units.
SynchronizeWithCentral
 Performs reload latest until the model in the current session is up to date and then saves changes back to central. A save to central is performed even if no changes were made.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UnpostFailure
 Deletes the posted failure message associated with a given FailureMessageKey.
See Also
Document Class
Autodesk.Revit.DB Namespace